Pandas - DataFrame And Series

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning.

In [142]:
import pandas as pd

In [143]:
## Series

data = [1,2,3,4]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [144]:
## Create series from dictionary
data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [145]:
data = [10,20,30,40]
index = ['a', 'b', 'c', 'd']
pd.Series(data, index=index)

a    10
b    20
c    30
d    40
dtype: int64

## Dataframe

In [146]:
## Dataframe
## Create a Dataframe from a dictionary of list

data = {
    'Name': ['sakib', 'rakib', 'hasan', 'abir'],
    'Age': [25, 28, 20, 23],
    'City': ["Chittagong", "Dhaka", "Rajshahi", "Cumilla"]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age        City
0  sakib   25  Chittagong
1  rakib   28       Dhaka
2  hasan   20    Rajshahi
3   abir   23     Cumilla
<class 'pandas.core.frame.DataFrame'>

In [147]:
import numpy as np
np.array(df)

array([['sakib', 25, 'Chittagong'],
       ['rakib', 28, 'Dhaka'],
       ['hasan', 20, 'Rajshahi'],
       ['abir', 23, 'Cumilla']], dtype=object)

In [148]:
## Create a Dataframe from a List of Dictionaries

data = [
    {'Name': "Sakib Ahamed Khan", 'Age': 25, 'City': "Chittagong"},
    {'Name': "Rakib Hasan", 'Age': 25, 'City': "Dhaka"},
    {'Name': "Nazmul Shanto", 'Age': 25, 'City': "Syhlet"},
    {'Name': "Robiul Islam", 'Age': 25, 'City': "Cumilla"},
    {'Name': "Musficur Rahman", 'Age': 25, 'City': "Rajshahi"},
]
df = pd.DataFrame(data)
print(df)
print(type(df))

                Name  Age        City
0  Sakib Ahamed Khan   25  Chittagong
1        Rakib Hasan   25       Dhaka
2      Nazmul Shanto   25      Syhlet
3       Robiul Islam   25     Cumilla
4    Musficur Rahman   25    Rajshahi
<class 'pandas.core.frame.DataFrame'>

In [149]:
df1 = pd.read_csv('sales_data.csv')
df1.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [150]:
## Accessing Data from Dataframe
df

                Name  Age        City
0  Sakib Ahamed Khan   25  Chittagong
1        Rakib Hasan   25       Dhaka
2      Nazmul Shanto   25      Syhlet
3       Robiul Islam   25     Cumilla
4    Musficur Rahman   25    Rajshahi

In [151]:
print(df['Name'])
print(type(df['Name']))

0    Sakib Ahamed Khan
1          Rakib Hasan
2        Nazmul Shanto
3         Robiul Islam
4      Musficur Rahman
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [152]:
df.loc[1] ## accessing row data
df.loc[1][0]

C:\Users\Sakib Ahamed Khan\AppData\Local\Temp\ipykernel_11480\3480907954.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[1][0]

'Rakib Hasan'

In [153]:
df.iloc[1]

Name    Rakib Hasan
Age              25
City          Dhaka
Name: 1, dtype: object

In [154]:
df3 = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [40, 50, 60]
}, index=[2, 3, 4])

print(df3)
print(df3.loc[4])
print(df3.iloc[0])

    A   B
2  10  40
3  20  50
4  30  60
A    30
B    60
Name: 4, dtype: int64
A    10
B    40
Name: 2, dtype: int64

In [155]:
## Accessing a specified element
df['Name']

0    Sakib Ahamed Khan
1          Rakib Hasan
2        Nazmul Shanto
3         Robiul Islam
4      Musficur Rahman
Name: Name, dtype: object

In [156]:
df.at[2, 'City']

'Syhlet'

In [157]:
## Accessing a specific element using iat
df.iat[2, 0]

'Nazmul Shanto'

In [158]:
## Data Manipulation with Dataframe
df

                Name  Age        City
0  Sakib Ahamed Khan   25  Chittagong
1        Rakib Hasan   25       Dhaka
2      Nazmul Shanto   25      Syhlet
3       Robiul Islam   25     Cumilla
4    Musficur Rahman   25    Rajshahi

In [159]:
## Adding a column
df['Salary']=[10000000,20000,30000,3000,40000]
df

                Name  Age        City    Salary
0  Sakib Ahamed Khan   25  Chittagong  10000000
1        Rakib Hasan   25       Dhaka     20000
2      Nazmul Shanto   25      Syhlet     30000
3       Robiul Islam   25     Cumilla      3000
4    Musficur Rahman   25    Rajshahi     40000

In [160]:
## Drop a column
df.drop('Age',axis=1)  ## axis is bydefault 0 show it check row field, axis=1 check colum to drop
## and also it not permanently droped

                Name        City    Salary
0  Sakib Ahamed Khan  Chittagong  10000000
1        Rakib Hasan       Dhaka     20000
2      Nazmul Shanto      Syhlet     30000
3       Robiul Islam     Cumilla      3000
4    Musficur Rahman    Rajshahi     40000

In [161]:
## Permanenty drop the Age column
df.drop('Age',axis=1, inplace=True)
df

                Name        City    Salary
0  Sakib Ahamed Khan  Chittagong  10000000
1        Rakib Hasan       Dhaka     20000
2      Nazmul Shanto      Syhlet     30000
3       Robiul Islam     Cumilla      3000
4    Musficur Rahman    Rajshahi     40000

In [162]:
## Add Salary to the column
df['Salary']=df['Salary']+5000
df

                Name        City    Salary
0  Sakib Ahamed Khan  Chittagong  10005000
1        Rakib Hasan       Dhaka     25000
2      Nazmul Shanto      Syhlet     35000
3       Robiul Islam     Cumilla      8000
4    Musficur Rahman    Rajshahi     45000

In [164]:
## Drop by row
df.drop(1) ## Drop by row and it is not permanently droped

                Name        City    Salary
0  Sakib Ahamed Khan  Chittagong  10005000
2      Nazmul Shanto      Syhlet     35000
3       Robiul Islam     Cumilla      8000
4    Musficur Rahman    Rajshahi     45000

In [165]:
## Permanently Drop the row
df.drop(1, inplace=True)
df

                Name        City    Salary
0  Sakib Ahamed Khan  Chittagong  10005000
2      Nazmul Shanto      Syhlet     35000
3       Robiul Islam     Cumilla      8000
4    Musficur Rahman    Rajshahi     45000

In [167]:
df1 = pd.read_csv('sales_data.csv')
df1.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
## Disply the data types of each column
print("Data types: \n", df1.dtypes)

# Describe the Dataframe
print("Statistical summary: \n", df1.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000